Поиск_вакансий_Сервер/src/DocumentJournals/ЖурналВакансий/ЖурналВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ЖурналВакансий</name>
  <registeredDocuments>Document.Вакансии</registeredDocuments>
  <columns>
    <name>ДатаОбновления</name>
  </columns>
  <columns>
    <name>Архив</name>
  </columns>
</mdclass:DocumentJournal>

Поиск_вакансий_Сервер/src/Documents/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакансии</name>
  <registerRecords>InformationRegister.ВакансияНомерКомпанияВакансии</registerRecords>
  <attributes>
    <name>ДатаОбновленияВакансии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работодатель</name>
    <type>
      <types>CatalogRef.Работодатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метро</name>
    <type>
      <types>CatalogRef.СтанцииМетро</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкПрограммирования</name>
    <type>
      <types>CatalogRef.ЯзыкиПрограммирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.Специализации</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоВПоиске</name>
    <type>
      <types>CatalogRef.КлючевыеСлова</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПодходит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтереснаяВакансия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БылОтклик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавилиМетроИзОписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленнаяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленнаяРаботаГород</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Поиск_вакансий_Сервер/src/DocumentJournals/ЖурналВакансий/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ОбработкаВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	
	ОбработкаВыбораНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СсылкаURLСсылка" Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке(Элемент.ТекущиеДанные.URLСсылка);	
		Возврат;
	КонецЕсли;	
	П = Новый Структура;
	Если Поле.Имя = "СсылкаРаботодатель" Тогда
		П.Вставить("Ключ", Элемент.ТекущиеДанные.СсылкаРаботодатель);	
		ОткрытьФорму("Справочник.Работодатели.ФормаОбъекта",П);
	Иначе	
		П.Вставить("Ключ", Элемент.ТекущиеДанные.Ссылка);	
		ОткрытьФорму("Документ.Вакансии.ФормаОбъекта", П);
	КонецЕсли;	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЗначениеСсылки(ОбъектССылка,Значение)
	Возврат ОбъектССылка[Значение];
КонецФункции

&НаКлиенте
Процедура НеИнтересно(Команда)
	ПометитьНаУдаление(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПометитьНаУдаление(ОбъектССылка)
	
	ПометимЕго = ОбъектССылка.ПолучитьОбъект();
	ПометимЕго.УстановитьПометкуУдаления(Истина);
КонецФункции

&НаКлиенте
Процедура БылОтклик(Команда)
	П = Новый Структура;
	П.Вставить("ВакансияИзЖурнала", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Документ.Отклики.ФормаОбъекта",П,);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура БылОткликНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура НеПодходитНаСервере(НеПодххх)
	НеПодхоитСерв = НеПодххх.ПолучитьОбъект();
	НеПодхоитСерв.НеПодходит =Истина;
	НеПодхоитСерв.Записать();
КонецПроцедуры

&НаКлиенте
Процедура НеПодходит(Команда)
	НеПодходитНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ИнтереснаяВакансияНаСервере(Интересн)
	НеПодхоитСерв = Интересн.ПолучитьОбъект();
	НеПодхоитСерв.ИнтереснаяВакансия =Истина;
	НеПодхоитСерв.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтереснаяВакансия(Команда)
	ИнтереснаяВакансияНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.Список.Обновить();
КонецПроцедуры


//&НаКлиенте
//Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	Если Поле.Имя = "СсылкаНаЖилье" Тогда
//	СтандартнаяОбработка = Ложь;
//	ПерейтиПоНавигационнойСсылке(Элемент.ТекущиеДанные.СсылкаНаЖилье)		
//		
//	КонецЕсли;	
//КонецПроцедуры


//&НаКлиенте
//Процедура СсылкаНаЖильеОткрытие(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	ПерейтиПоНавигационнойСсылке(Элемент.ТекстРедактирования)
//КонецПроцедуры
